{
  "id": "property-ZM28",
  "title": "Spectacular 5 Bedroom Designer Luxury Villa in Bangpor",
  "description": "Overview\nAn award-winning luxury villa for sale in Koh Samui - situated in the pristine private hillside of Bangpor. Featuring chic contemporary minimal architecture and sleek clean lines with spectacular sea views, the villa is impressive and imposing property with immaculate presentation. \nThe property is set over 3 stunning stories and comprises of 5 bedroom, 5 bathrooms and is poised 180 metres above sea level in the beautiful Bangpor hillside, high above Koh Samui's peaceful north coast. This unique ultra-luxury property is also located just 800 metres from a quiet stretch of white sandy beach.\n \nA spacious open-plan living room surveys the magnificent ocean views and poolside. A sleek designer kitchen comes fully equipped with high-quality appliances. Spacious and luxurious bedrooms feature bespoke furnishings en-suite bathrooms with bathtubs. Private balconies offer sensational sea views and of the stunning natural surroundings. \nOutside there is generous infinity-edge private swimming pool literally pours into the soothing ocean vistas. Thoughtful inclusions like built in, cushioned day bed seating areas and a beautiful built-in barbecue unit in the poolside sala add to the sense of sophistication and luxury. \nBeautifully planted tropical private garden areas punctuate the living spaces at all levels, surrounding the villa with natural lush tropical greenery, counterbalanced against state-of-the-art technology, complimenting the natural homely interior ambience.\n \nEach guest bedroom room boasts a large King-size bed and spacious and luxurious ensuite bathrooms. The fifth bedroom can be converted for younger guests, with two twin beds and two purpose-built bunk beds. Luxurious linens and amenities create a sumptuous tactile environment throughout. \nOverall this exceptional ultra-luxury property for sale in Koh Samui combines world-class architecture and engineering, with intelligent layout and chic interior design, and would make an ideal luxury lifestyle investment. \n\n*Note: the villa is priced at 2.1 million USD but is shown in the approximate equivalent THB rate.\nKey Features\n•\t5 bedroom, 5 bathroom luxury pool villas \n•\tLocated in pristine private Bang Por hills\n•\tDesigned by award-winning architect \n•\tSpectacular 270 degree ocean views \n•\tSeek modern design with clean lines\n•\tSituated 800 meters from the beach \n•\tHigh spec furnishing & decorations\n•\tL shaped infinity-edge pool (15x10m)\n•\tSpacious outdoor covered pool-Sala\n•\tState of the art Barbecue unit \n•\t60 inch 3D television system\n•\tSpacious outdoor living areas\n•\tSpacious & luxurious bedrooms \n•\tEn-suites with bathtubs\n•\tPrivate covered parking \n•\tLarge landscaped garden\n•\tBuilt area: 650 sq.m.\n•\tFreehold ownership \n•\tChanote title \n",
  "price": 79000000,
  "type": "Sea View ",
  "bedrooms": 5,
  "bathrooms": 5.0,
  "location": {
    "city": "Koh Samui",
    "country": "Thailand",
    "area": "Bangpor"
  },
  "features": [
    "Sea View "
  ],
  "images": [],
  "featured": false,
  "newProperty": false,
  "active": true
} 